#+TITLE: Unit Tests & Examples for Orgtbl Join
Copyright (C) 2014-2026  Thierry Banel

orgtbl-join is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

orgtbl-join is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.

** Play with M-x orgtbl-join

Those recipes should to be augmented interactively with nutritional facts

The master tables have a formula on the last column, which will be
preserved after joining.

With header.
- Put the cursor on the "type" column
- type
  : M-x orgtbl-join
- answer
  : nut_with_header
  : type

| quty | type     | units |  mul |
|------+----------+-------+------|
|   70 | onion    |     5 |  350 |
|  120 | tomatoe  |     8 |  960 |
|  300 | eggplant |     2 |  600 |
|------+----------+-------+------|
|  100 | tofu     |     1 |  100 |
|  250 | corn     |    15 | 3750 |
|   90 | tomatoe  |     5 |  450 |
|------+----------+-------+------|
|   80 | amarante |     1 |   80 |
#+TBLFM: $4=$1*$3

Without header.
- Put the cursor on the second column
- type
  : M-x orgtbl-join
- answer
  : nut_with_header
  : type

|  70 | onion    |  5 |  350 |
| 120 | tomatoe  |  8 |  960 |
| 300 | eggplant |  2 |  600 |
| 100 | tofu     |  1 |  100 |
| 250 | corn     | 15 | 3750 |
|  90 | tomatoe  |  5 |  450 |
|  80 | amarante |  1 |   80 |
#+TBLFM: $4=$1*$3

** surviving name and formula

#+BEGIN: join :mas-table meal_with_header :mas-column $1 :ref-table nut_with_header :ref-column $2 :formula "@1$7=totcarb"
#+name: enriched
#+caption: the enriched table
#+attr_center: yes
| product   |   quty | Carb | Fiber | Sugar | Protein | totcarb |
| common    |     in | ohyd |       |       |         |         |
| name      | gramms | rate |       |       |         |         |
| (english) |        |      |       |       |         |         |
|-----------+--------+------+-------+-------+---------+---------|
| onion     |     70 |  9.0 |   1.3 |   4.4 |     1.3 |    630. |
| unknown   |    999 |      |       |       |         |       0 |
| tomatoe   |    120 |  3.4 |   0.6 |   2.1 |     0.8 |    408. |
| eggplant  |    300 |  8.6 |   2.5 |   3.2 |     0.8 |   2580. |
| eggplant  |    300 |  8.7 |   2.6 |   3.3 |     0.9 |   2610. |
| eggplant  |    300 |  8.5 |     ? |     ? |       ? |   2550. |
| corn      |    250 | 21.3 |   4.7 |   1.8 |     2.8 |   5325. |
#+TBLFM: $7=$2*$3::@1$7=totcarb
#+END:

